<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"544d9304e1a8cc5f36b8f081f72ab17edf66c08c404dd8106b1c2136ce4c19e4","plan_job_ref":"Job Create MPE Management terraform plan #10 at https://github.com/AFMPE/mpe_management/actions/runs/7289765245","plan_hash":"22741bca92d1593a805da8519cf52396d1ee4e14b2685764f3b76f3ae38a6eb5","plan_text_format":"trunc","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=ampev2            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
subscription_id_codex    = (sensitive value)
subscription_id_dev      = (sensitive value)
subscription_id_devlab   = (sensitive value)
subscription_id_forensic = (sensitive value)
subscription_id_hub      = (sensitive value)
subscription_id_identity = (sensitive value)
subscription_id_sandbox  = (sensitive value)
subscription_id_security = (sensitive value)
vm_admin_password        = (sensitive value)
```
</details>
<details>
<summary>Plan: 156 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_subscription_template_deployment.telemetry_mgt_lz[0] will be created
  + resource "azurerm_subscription_template_deployment" "telemetry_mgt_lz" {
      + id                 = (known after apply)
      + location           = "eastus"
      + name               = (known after apply)
      + output_content     = (known after apply)
      + parameters_content = (known after apply)
      + template_content   = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2018-05-01/subscriptionDeploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + outputs        = {
                  + telemetry = {
                      + type  = "String"
                      + value = "For more information, see https://aka.ms/azurenoops/tf/telemetry"
                    }
                }
              + parameters     = {}
              + resources      = []
              + variables      = {}
            }
        )
    }

  # random_id.telem[0] will be created
  + resource "random_id" "telem" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # time_sleep.after_azurerm_management_group will be created
  + resource "time_sleep" "after_azurerm_management_group" {
      + create_duration  = "30s"
      + destroy_duration = "0s"
      + id               = (known after apply)
      + triggers         = {
          + "azurerm_management_group" = jsonencode(
                [
                  + "management_groups",
                ]
            )
        }
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.ddos will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "ddos" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_ddos_protection_plan"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.nsg["default"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
          + "default",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.nsg["private-endpoints"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
          + "private-endpoints",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.nsg["vm"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
          + "vm",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.rt will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "rt" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_route_table"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.snet["default"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "snet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
          + "default",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.snet["private-endpoints"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "snet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
          + "private-endpoints",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.snet["vm"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "snet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
          + "vm",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.st will be read during apply
  # (config refers to values not yet known)
 <= data "azurenoopsutils_resource_name" "st" {
      + id            = (known after apply)
      + name          = (known after apply)
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.vnet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "vnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.vnet_peering_hub will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "vnet_peering_hub" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_virtual_network_peering"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_devsecops_network.data.azurerm_network_watcher.nwatcher will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_watcher" "nwatcher" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "NetworkWatcher_eastus"
      + resource_group_name = "NetworkWatcherRG"
      + tags                = (known after apply)
    }

  # module.mod_devsecops_network.data.azurerm_resource_group.netwatch will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "netwatch" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "NetworkWatcherRG"
      + tags       = (known after apply)
    }

  # module.mod_devsecops_network.data.azurerm_virtual_network.hub_vnet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "hub_vnet" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "ampe-eus-hub-core-dev-vnet"
      + resource_group_name     = "ampe-eus-hub-core-dev-rg"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_network_security_group.nsg["default"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = "Allow traffic from spokes"
              + destination_address_prefix                 = "10.8.7.0/24"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "22",
                  + "3389",
                  + "443",
                  + "80",
                ]
              + direction                                  = "Inbound"
              + name                                       = "Allow-Traffic-From-Spokes"
              + priority                                   = 200
              + protocol                                   = "*"
              + source_address_prefix                      = ""
              + source_address_prefixes                    = [
                  + "10.8.6.0/24",
                  + "10.8.8.0/24",
                  + "10.8.9.0/24",
                ]
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "ResourceName" = "nsg_default"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "dev"
          + "workload"     = "devsecops"
        }
    }

  # module.mod_devsecops_network.azurerm_network_security_group.nsg["private-endpoints"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + security_rule       = (known after apply)
      + tags                = {
          + "ResourceName" = "nsg_private-endpoints"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "dev"
          + "workload"     = "devsecops"
        }
    }

  # module.mod_devsecops_network.azurerm_network_security_group.nsg["vm"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + security_rule       = (known after apply)
      + tags                = {
          + "ResourceName" = "nsg_vm"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "dev"
          + "workload"     = "devsecops"
        }
    }

  # module.mod_devsecops_network.azurerm_network_watcher_flow_log.nwflog["default"] will be created
  + resource "azurerm_network_watcher_flow_log" "nwflog" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "network-watcher-flog-log-devsecops"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_eastus"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 0
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = (known after apply)
          + workspace_region      = "eastus"
          + workspace_resource_id = (known after apply)
        }
    }

  # module.mod_devsecops_network.azurerm_network_watcher_flow_log.nwflog["private-endpoints"] will be created
  + resource "azurerm_network_watcher_flow_log" "nwflog" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "network-watcher-flog-log-pe"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_eastus"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 0
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = (known after apply)
          + workspace_region      = "eastus"
          + workspace_resource_id = (known after apply)
        }
    }

  # module.mod_devsecops_network.azurerm_network_watcher_flow_log.nwflog["vm"] will be created
  + resource "azurerm_network_watcher_flow_log" "nwflog" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "network-watcher-flog-log-vm"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_eastus"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 0
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = (known after apply)
          + workspace_region      = "eastus"
          + workspace_resource_id = (known after apply)
        }
    }

  # module.mod_devsecops_network.azurerm_role_assignment.dns["privatelink.vaultcore.azure.net"] will be created
  + resource "azurerm_role_assignment" "dns" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Private DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_role_assignment.peering will be created
  + resource "azurerm_role_assignment" "peering" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_route.force_internet_tunneling[0] will be created
  + resource "azurerm_route" "force_internet_tunneling" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = (known after apply)
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = (known after apply)
      + route_table_name       = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_route_table.routetable will be created
  + resource "azurerm_route_table" "routetable" {
      + disable_bgp_route_propagation = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = (known after apply)
      + resource_group_name           = (known after apply)
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "ResourceName" = "route-network-outbound"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "dev"
          + "workload"     = "devsecops"
        }
    }

  # module.mod_devsecops_network.azurerm_subnet.default_snet["default"] will be created
  + resource "azurerm_subnet" "default_snet" {
      + address_prefixes                               = [
          + "10.8.7.224/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet.default_snet["private-endpoints"] will be created
  + resource "azurerm_subnet" "default_snet" {
      + address_prefixes                               = [
          + "10.8.7.96/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet.default_snet["vm"] will be created
  + resource "azurerm_subnet" "default_snet" {
      + address_prefixes                               = [
          + "10.8.7.64/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet_network_security_group_association.nsgassoc["default"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet_network_security_group_association.nsgassoc["private-endpoints"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet_network_security_group_association.nsgassoc["vm"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet_route_table_association.rtassoc["default"] will be created
  + resource "azurerm_subnet_route_table_association" "rtassoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet_route_table_association.rtassoc["private-endpoints"] will be created
  + resource "azurerm_subnet_route_table_association" "rtassoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet_route_table_association.rtassoc["vm"] will be created
  + resource "azurerm_subnet_route_table_association" "rtassoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subscription_template_deployment.telemetry_core[0] will be created
  + resource "azurerm_subscription_template_deployment" "telemetry_core" {
      + id                 = (known after apply)
      + location           = "eastus"
      + name               = (known after apply)
      + output_content     = (known after apply)
      + parameters_content = (known after apply)
      + template_content   = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2018-05-01/subscriptionDeploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + outputs        = {
                  + telemetry = {
                      + type  = "String"
                      + value = "For more information, see https://aka.ms/azurenoops/tf/telemetry"
                    }
                }
              + parameters     = {}
              + resources      = []
              + variables      = {}
            }
        )
    }

  # module.mod_devsecops_network.azurerm_virtual_network.spoke_vnet will be created
  + resource "azurerm_virtual_network" "spoke_vnet" {
      + address_space       = [
          + "10.8.7.0/24",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + subnet              = (known after apply)
      + tags                = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_virtual_network_peering.hub_to_spoke will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering-ampe-eus-hub-core-dev-vnet-to-devsecops-spoke"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "ampe-eus-hub-core-dev-rg"
      + use_remote_gateways          = false
      + virtual_network_name         = "ampe-eus-hub-core-dev-vnet"
    }

  # module.mod_devsecops_network.azurerm_virtual_network_peering.spoke_to_hub will be created
  + resource "azurerm_virtual_network_peering" "spoke_to_hub" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering-devsecops-spoke-to-ampe-eus-hub-core-dev-vnet"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = (known after apply)
      + use_remote_gateways          = false
      + virtual_network_name         = (known after apply)
    }

  # module.mod_devsecops_network.random_id.telem[0] will be created
  + resource "random_id" "telem" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.mod_devsecops_network.random_id.uniqueString will be created
  + resource "random_id" "uniqueString" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "org_prefix" = "ampe"
          + "subid"      = "devsecops"
        }
    }

  # module.mod_hub_network.data.azurenoopsutils_resource_name.st will be read during apply
  # (config refers to values not yet known)
 <= data "azurenoopsutils_resource_name" "st" {
      + id            = (known after apply)
      + name          = (known after apply)
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # module.mod_hub_network.data.azurerm_network_watcher.nwatcher will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_watcher" "nwatcher" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "NetworkWatcher_eastus"
      + resource_group_name = "NetworkWatcherRG"
      + tags                = (known after apply)
    }

  # module.mod_hub_network.data.azurerm_resource_group.netwatch will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "netwatch" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "NetworkWatcherRG"
      + tags       = (known after apply)
    }

  # module.mod_hub_network.azurerm_bastion_host.main[0] will be created
  + resource "azurerm_bastion_host" "main" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus"
      + name                   = "ampe-eus-hub-core-dev-bast"
      + resource_group_name    = "ampe-eus-hub-core-dev-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Standard"
      + tags                   = {
          + "ResourceName" = "ampe-eus-hub-core-dev-bast"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "dev"
          + "workload"     = "hub-core"
        }
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "ampe-eus-hub-core-dev-bast-network"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.mod_hub_network.azurerm_firewall.fw[0] will be created
  + resource "azurerm_firewall" "fw" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "ampe-eus-hub-core-dev-fw"
      + resource_group_name = "ampe-eus-hub-core-dev-rg"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Standard"
      + tags                = {
          + "ResourceName" = "ampe-eus-hub-core-dev-fw"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "dev"
          + "workload"     = "hub-core"
        }
      + threat_intel_mode   = "Alert"

      + ip_configuration {
          + name                 = "ampe-eus-hub-core-dev-fw-ipconfig"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }

      + management_ip_configuration {
          + name                 = "ampe-eus-hub-core-dev-fw-forced-tunnel-ipconfig"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.mod_hub_network.azurerm_firewall_policy.firewallpolicy will be created
  + resource "azurerm_firewall_policy" "firewallpolicy" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "ampe-eus-hub-core-dev-afwp"
      + resource_group_name      = "ampe-eus-hub-core-dev-rg"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Standard"
      + threat_intelligence_mode = "Alert"
    }

  # module.mod_hub_network.azurerm_firewall_policy_rule_collection_group.app_rule_collection_group will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "app_rule_collection_group" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "ampe-eus-hub-core-dev-afwp-default-arcg"
      + priority           = 300

      + application_rule_collection {
          + action   = "Allow"
          + name     = "AzureAuth"
          + priority = 110

          + rule {
              + destination_fqdns = [
                  + "aadcdn.msftauth.net",
                  + "aadcdn.msauth.net",
                ]
              + name              = "msftauth"
              + source_addresses  = [
                  + "*",
                ]

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }
      + application_rule_collection {
          + action   = "Allow"
          + name     = "AppServiceEnvironment"
          + priority = 500

          + rule {
              + destination_fqdns = [
                  + "AppServiceEnvironment",
                  + "WindowsUpdate",
                ]
              + name              = "AppServiceEnvironment"
              + source_addresses  = [
                  + "*",
                ]

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }
    }

  # module.mod_hub_network.azurerm_firewall_policy_rule_collection_group.nat_rule_collection_group will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "nat_rule_collection_group" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "ampe-eus-hub-core-dev-afwp-default-natrcg"
      + priority           = 110
    }

  # module.mod_hub_network.azurerm_firewall_policy_rule_collection_group.nw_rule_collection_group will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "nw_rule_collection_group" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "ampe-eus-hub-core-dev-afwp-default-nwrcg"
      + priority           = 100

      + network_rule_collection {
          + action   = "Allow"
          + name     = "AllowAzureCloud"
          + priority = 100

          + rule {
              + destination_addresses = [
                  + "AzureCloud",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "AzureCloud"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
        }
      + network_rule_collection {
          + action   = "Allow"
          + name     = "AppServiceEnvironment"
          + priority = 300

          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "123",
                ]
              + name                  = "NTP"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
        }
      + network_rule_collection {
          + action   = "Allow"
          + name     = "AzureMonitor"
          + priority = 500

          + rule {
              + destination_addresses = [
                  + "AzureMonitor",
                ]
              + destination_ports     = [
                  + "80",
                  + "443",
                  + "12000",
                ]
              + name                  = "AzureMonitor"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
        }
      + network_rule_collection {
          + action   = "Allow"
          + name     = "AllowTrafficBetweenSpokes"
          + priority = 200

          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "AllSpokeTraffic"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.96.0.0/19",
                ]
            }
        }
      + network_rule_collection {
          + action   = "Allow"
          + name     = "AllowTrafficForACAS"
          + priority = 200

          + rule {
              + destination_addresses = [
                  + "10.8.10.0/24",
                ]
              + destination_ports     = [
                  + "22",
                  + "8834",
                  + "8835",
                ]
              + name                  = "AllACASTraffic"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "128.63.27.0/24",
                  + "128.63.27.80/32",
                ]
            }
        }
    }

  # module.mod_hub_network.azurerm_network_ddos_protection_plan.ddos[0] will be created
  + resource "azurerm_network_ddos_protection_plan" "ddos" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "ampe-eus-hub-core-dev-ddospp"
      + resource_group_name = "ampe-eus-hub-core-dev-rg"
      + tags                = {
          + "ResourceName" = "ampe-eus-hub-core-dev-ddospp"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "dev"
          + "workload"     = "hub-core"
        }
      + virtual_network_ids = (known after apply)
    }

  # module.mod_hub_network.azurerm_network_security_group.nsg["default"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "ampe-eus-hub-core-dev-default-nsg"
      + resource_group_name = "ampe-eus-hub-core-dev-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "ResourceName" = "nsg_default"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "dev"
          + "workload"     = "hub-core"
        }
    }

  # module.mod_hub_network.azurerm_network_watcher_flow_log.nwflog["default"] will be created
  + resource "azurerm_network_watcher_flow_log" "nwflog" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "network-watcher-flow-log-hub"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_eastus"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 0
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = (known after apply)
          + workspace_region      = "eastus"
          + workspace_resource_id = (known after apply)
        }
    }

  # module.mod_hub_network.azurerm_public_ip.bastion_pip[0] will be created
  + resource "azurerm_public_ip" "bastion_pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "ampe-eus-hub-core-dev-bas-pip"
      + resource_group_name     = "ampe-eus-hub-core-dev-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "ResourceName" = "ampe-eus-hub-core-dev-bas-pip"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "dev"
          + "workload"     = "hub-core"
        }
    }

  # module.mod_hub_network.azurerm_public_ip.firewall_client_pip[0] will be created
  + resource "azurerm_public_ip" "firewall_client_pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "ampe-eus-hub-core-dev-fw-client-pip"
      + public_ip_prefix_id     = (known after apply)
      + resource_group_name     = "ampe-eus-hub-core-dev-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "deployedBy" = "AzureNoOpsTF"
        }
    }

  # module.mod_hub_network.azurerm_public_ip.firewall_management_pip[0] will be created
  + resource "azurerm_public_ip" "firewall_management_pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "ampe-eus-hub-core-dev-fw-management-pip"
      + public_ip_prefix_id     = (known after apply)
      + resource_group_name     = "ampe-eus-hub-core-dev-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "deployedBy" = "AzureNoOpsTF"
        }
    }

  # module.mod_hub_network.azurerm_public_ip_prefix.firewall_pref[0] will be created
  + resource "azurerm_public_ip_prefix" "firewall_pref" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + ip_version          = "IPv4"
      + location            = "eastus"
      + name                = "ampe-eus-hub-core-dev-fw-prefix"
      + prefix_length       = 30
      + resource_group_name = "ampe-eus-hub-core-dev-rg"
      + sku                 = "Standard"
      + tags                = {
          + "ResourceName" = "ampe-eus-hub-core-dev-fw-prefix"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "dev"
          + "workload"     = "hub-core"
        }
    }

  # module.mod_hub_network.azurerm_role_assignment.peering will be created
  + resource "azurerm_role_assignment" "peering" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "************************************"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.mod_hub_network.azurerm_route.force_internet_tunneling[0] will be created
  + resource "azurerm_route" "force_internet_tunneling" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "route-to-firewall-ampe-eus-hub-core-dev-vnet-eastus"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "ampe-eus-hub-core-dev-rg"
      + route_table_name       = "ampe-eus-hub-core-dev-route"
    }

  # module.mod_hub_network.azurerm_route_table.routetable will be created
  + resource "azurerm_route_table" "routetable" {
      + disable_bgp_route_propagation = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "ampe-eus-hub-core-dev-route"
      + resource_group_name           = "ampe-eus-hub-core-dev-rg"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "ResourceName" = "route-network-outbound"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "dev"
          + "workload"     = "hub-core"
        }
    }

  # module.mod_hub_network.azurerm_subnet.abs_snet[0] will be created
  + resource "azurerm_subnet" "abs_snet" {
      + address_prefixes                               = [
          + "10.8.4.192/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "ampe-eus-hub-core-dev-rg"
      + virtual_network_name                           = "ampe-eus-hub-core-dev-vnet"
    }

  # module.mod_hub_network.azurerm_subnet.default_snet["default"] will be created
  + resource "azurerm_subnet" "default_snet" {
      + address_prefixes                               = [
          + "10.8.4.224/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ampe-eus-hub-core-dev-default-snet"
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "ampe-eus-hub-core-dev-rg"
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "ampe-eus-hub-core-dev-vnet"
    }

  # module.mod_hub_network.azurerm_subnet.firewall_client_snet[0] will be created
  + resource "azurerm_subnet" "firewall_client_snet" {
      + address_prefixes                               = [
          + "10.8.4.64/26",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallSubnet"
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "ampe-eus-hub-core-dev-rg"
      + virtual_network_name                           = "ampe-eus-hub-core-dev-vnet"
    }

  # module.mod_hub_network.azurerm_subnet.firewall_management_snet[0] will be created
  + resource "azurerm_subnet" "firewall_management_snet" {
      + address_prefixes                               = [
          + "10.8.4.128/26",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallManagementSubnet"
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "ampe-eus-hub-core-dev-rg"
      + virtual_network_name                           = "ampe-eus-hub-core-dev-vnet"
    }

  # module.mod_hub_network.azurerm_subnet.pe_snet will be created
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #10](https://github.com/AFMPE/mpe_management/actions/runs/7289765245)